<?php

namespace Database\Seeders;

use App\Models\Activity;
use App\Models\Offer;
use App\Models\Region;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ActivitySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $activities = [
            [
                'name_ru' => 'Рафтинг',
                'name' => ['ru' => 'Рафтинг'],
            ],
            [
                'name_ru' => 'Экскурсии на автомобилях 4x4',
                'name' => ['ru' => 'Экскурсии на автомобилях 4x4'],
            ],
            [
                'name_ru' => 'Каньонинг',
                'name' => ['ru' => 'Каньонинг'],
            ],
            [
                'name_ru' => 'Скалолазание',
                'name' => ['ru' => 'Скалолазание'],
            ],
            [
                'name_ru' => 'Каньонинг',
                'name' => ['ru' => 'Каньонинг'],
            ],
            [
                'name_ru' => 'Трекинг',
                'name' => ['ru' => 'Трекинг'],
            ],
            [
                'name_ru' => 'Пешеходная экскурсия',
                'name' => ['ru' => 'Пешеходная экскурсия'],
            ],
            [
                'name_ru' => 'Велопрогулки',
                'name' => ['ru' => 'Велопрогулки'],
            ],
            [
                'name_ru' => 'Конные прогулки',
                'name' => ['ru' => 'Конные прогулки'],
            ],
            [
                'name_ru' => 'Купание в геотермальных источниках',
                'name' => ['ru' => 'Купание в геотермальных источниках'],
            ],
            [
                'name_ru' => 'Посещение бани',
                'name' => ['ru' => 'Посещение бани'],
            ],
            [
                'name_ru' => 'Автобусная экскурсия',
                'name' => ['ru' => 'Автобусная экскурсия'],
            ],
            [
                'name_ru' => 'Теплоходная экскурсия',
                'name' => ['ru' => 'Теплоходная экскурсия'],
            ],
            [
                'name_ru' => 'Дегустация национальной кухни',
                'name' => ['ru' => 'Дегустация национальной кухни'],
            ],
            [
                'name_ru' => 'Наблюдение за птицами',
                'name' => ['ru' => 'Наблюдение за птицами'],
            ],
            [
                'name_ru' => 'Тур в природный заповедник',
                'name' => ['ru' => 'Тур в природный заповедник'],
            ],
            [
                'name_ru' => 'Тур выходного дня',
                'name' => ['ru' => 'Тур выходного дня'],
            ],
            [
                'name_ru' => 'Паломнический тур',
                'name' => ['ru' => 'Паломнический тур'],
            ],
            [
                'name_ru' => 'Каякинг',
                'name' => ['ru' => 'Каякинг'],
            ],
            [
                'name_ru' => 'Яхтинг',
                'name' => ['ru' => 'Яхтинг'],
            ],
            [
                'name_ru' => 'Каньонинг',
                'name' => ['ru' => 'Каньонинг'],
            ],
            [
                'name_ru' => 'Новогодние каникулы',
                'name' => ['ru' => 'Новогодние каникулы'],
            ],
            [
                'name_ru' => 'Наблюдение за Северным сиянием',
                'name' => ['ru' => 'Наблюдение за Северным сиянием'],
            ],
            [
                'name_ru' => 'Катание на горных лыжах и сноубордах',
                'name' => ['ru' => 'Катание на горных лыжах и сноубордах'],
            ],
            [
                'name_ru' => 'Экспедиционный круиз',
                'name' => ['ru' => 'Экспедиционный круиз'],
            ],
            [
                'name_ru' => 'Катание на снегоходах',
                'name' => ['ru' => 'Катание на снегоходах	'],
            ],
        ];

        foreach ($activities as $activity) {
            Activity::updateOrCreate(
                ['name_ru' => $activity['name_ru']],
                $activity
            );
        }
    }
}
