<?php

namespace Database\Seeders;

use App\Models\Country;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CountrySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $countries = [
            ['name_ru' => 'Австралия', 'name' => ['ru' => 'Австралия']],
            ['name_ru' => 'Австрия', 'name' => ['ru' => 'Австрия']],
            ['name_ru' => 'Узбекистан', 'name' => ['ru' => 'Узбекистан']],
            ['name_ru' => 'Азербайджан', 'name' => ['ru' => 'Азербайджан']],
            ['name_ru' => 'Аргентина', 'name' => ['ru' => 'Аргентина']],
            ['name_ru' => 'Ангуилья остров', 'name' => ['ru' => 'Ангуилья остров']],
            ['name_ru' => 'Албания', 'name' => ['ru' => 'Албания']],
            ['name_ru' => 'Алжир', 'name' => ['ru' => 'Алжир']],
            ['name_ru' => 'Британские Виргинские Острова (США)', 'name' => ['ru' => 'Британские Виргинские Острова (США)']],
            ['name_ru' => 'Американское Самоа', 'name' => ['ru' => 'Американское Самоа']],
            ['name_ru' => 'Ангилья', 'name' => ['ru' => 'Ангилья']],
            ['name_ru' => 'Антигуа', 'name' => ['ru' => 'Антигуа']],
            ['name_ru' => 'Аруба', 'name' => ['ru' => 'Аруба']],
            ['name_ru' => 'Антигуа и Барбуда', 'name' => ['ru' => 'Антигуа и Барбуда']],
            ['name_ru' => 'Армения', 'name' => ['ru' => 'Армения']],
            ['name_ru' => 'Гренада', 'name' => ['ru' => 'Гренада']],
            ['name_ru' => 'Барбадос', 'name' => ['ru' => 'Барбадос']],
            ['name_ru' => 'Багамские Острова', 'name' => ['ru' => 'Багамские Острова']],
            ['name_ru' => 'Бахрейн', 'name' => ['ru' => 'Бахрейн']],
            ['name_ru' => 'Беноа', 'name' => ['ru' => 'Беноа']],
            ['name_ru' => 'Белиз', 'name' => ['ru' => 'Белиз']],
            ['name_ru' => 'Бенин', 'name' => ['ru' => 'Бенин']],
            ['name_ru' => 'Бермуды', 'name' => ['ru' => 'Бермуды']],
            ['name_ru' => 'Бегумпет', 'name' => ['ru' => 'Бегумпет']],
            ['name_ru' => 'Болгария', 'name' => ['ru' => 'Болгария']],
            ['name_ru' => 'Боливия', 'name' => ['ru' => 'Боливия']],
            ['name_ru' => 'Босния, Синт-Статиус и Саба', 'name' => ['ru' => 'Босния, Синт-Статиус и Саба']],
            ['name_ru' => 'Босния и Герцеговина', 'name' => ['ru' => 'Босния и Герцеговина']],
            ['name_ru' => 'Ботсвана', 'name' => ['ru' => 'Ботсвана']],
            ['name_ru' => 'Бразилия', 'name' => ['ru' => 'Бразилия']],
            ['name_ru' => 'Британская территория в Индийском океане', 'name' => ['ru' => 'Британская территория в Индийском океане']],
            ['name_ru' => 'Британские Острова (Бермудские острова)', 'name' => ['ru' => 'Британские Острова (Бермудские острова)']],
            ['name_ru' => 'Бруней', 'name' => ['ru' => 'Бруней']],
            ['name_ru' => 'Бруней-Даруссалам', 'name' => ['ru' => 'Бруней-Даруссалам']],
            ['name_ru' => 'Буркина', 'name' => ['ru' => 'Буркина']],
            ['name_ru' => 'Бурунди', 'name' => ['ru' => 'Бурунди']],
            ['name_ru' => 'Бутан', 'name' => ['ru' => 'Бутан']],
            ['name_ru' => 'Вануату', 'name' => ['ru' => 'Вануату']],
            ['name_ru' => 'Венгрия', 'name' => ['ru' => 'Венгрия']],
            ['name_ru' => 'Венера', 'name' => ['ru' => 'Венера']],
            ['name_ru' => 'Венесуэла', 'name' => ['ru' => 'Венесуэла']],
            ['name_ru' => 'Британские Виргинские Острова', 'name' => ['ru' => 'Британские Виргинские Острова']],
            ['name_ru' => 'Восточный Тимор', 'name' => ['ru' => 'Восточный Тимор']],
            ['name_ru' => 'Фалкон', 'name' => ['ru' => 'Фалкон']],
            ['name_ru' => 'Фиджи', 'name' => ['ru' => 'Фиджи']],
            ['name_ru' => 'Фалкана', 'name' => ['ru' => 'Фалкана']],
        ];

        foreach ($countries as $country) {
            Country::updateOrCreate(
                ['name_ru' => $country['name_ru']],
                $country
            );
        }
    }
}
